In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("../data/salaries.csv")

In [3]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025,EX,FT,Head of Data,348516,USD,348516,US,0,US,M
1,2025,EX,FT,Head of Data,232344,USD,232344,US,0,US,M
2,2025,SE,FT,Data Scientist,145400,USD,145400,US,0,US,M
3,2025,SE,FT,Data Scientist,81600,USD,81600,US,0,US,M
4,2025,MI,FT,Engineer,160000,USD,160000,US,100,US,M
...,...,...,...,...,...,...,...,...,...,...,...
151440,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
151441,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
151442,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
151443,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
151444,2021,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

Most salary in USD

In [10]:
df.sort_values("salary_in_usd",ascending=False).iloc[0]

work_year                  2025
experience_level             SE
employment_type              FT
job_title             Architect
salary                   800000
salary_currency             USD
salary_in_usd            800000
employee_residence           US
remote_ratio                  0
company_location             US
company_size                  M
Name: 30884, dtype: object

Min salary in USD

In [12]:
df.sort_values("salary_in_usd",ascending=True).iloc[0]

work_year                                        2022
experience_level                                   MI
employment_type                                    FT
job_title             Business Intelligence Developer
salary                                          15000
salary_currency                                   USD
salary_in_usd                                   15000
employee_residence                                 GH
remote_ratio                                      100
company_location                                   GH
company_size                                        M
Name: 145711, dtype: object

Recuento total de personas por titulo

In [15]:
df.value_counts("job_title").head(10)

job_title
Data Scientist               18751
Software Engineer            16948
Data Engineer                16352
Data Analyst                 13779
Engineer                     11004
Machine Learning Engineer     8887
Manager                       7811
Analyst                       5396
Research Scientist            3460
Product Manager               2576
Name: count, dtype: int64

Recuento de personas por pais de residencia

In [17]:
df.value_counts("employee_residence").head(10)

employee_residence
US    135506
CA      6207
GB      4172
AU       590
NL       482
DE       445
FR       441
LT       372
AT       355
ES       313
Name: count, dtype: int64

Recuento de salarios argentinos

In [24]:
ARGENTINA = (df["employee_residence"] == "AR").sum()
print(f"Cantidad de salarios en Argentina {ARGENTINA}")

Cantidad de salarios en Argentina 90

Salarios mayores a $100.000 USD (En este Dataset)

In [32]:
sueldo_mayor_argentina = ((df["employee_residence"] == "AR") & (df["salary_in_usd"] > 100000)).sum()
print(f"En argentina existen tan solo {sueldo_mayor_argentina} personas que tienen un sueldo mayor a $100.000 dolares anuales")

En argentina existen tan solo 16 personas que tienen un sueldo mayor a $100.000 dolares anuales

Recuento de Argentinos por nivel de experiencia

In [34]:
df[df["employee_residence"] == "AR"]["experience_level"].value_counts()

experience_level
SE    48
EN    22
MI    20
Name: count, dtype: int64

Promedio de salario de Estados Unidos vs Argentina (En Dolares)

In [37]:
df.groupby("employee_residence")["salary_in_usd"].mean().loc[["US","AR"]]

employee_residence
US    163944.997934
AR     77356.511111
Name: salary_in_usd, dtype: float64

Mediana de salario de Estados Unidos vs Argentina (En dolares)

In [38]:
df.groupby("employee_residence")["salary_in_usd"].median().loc[["US","AR"]]

employee_residence
US    151270.0
AR     66600.0
Name: salary_in_usd, dtype: float64